In [2]:
import mysql.connector
import pandas as pd


    # configuration of user details
# change them to your user name and password to make examples run on your machine
config = {'user': 'William', 'password': 'SQLpassword', 'auth_plugin' : 'mysql_native_password', 
          'host': 'localhost', 'database': 'classicmodels'}

In [3]:
cnx = mysql.connector.connect(**config) # connect with config-user details
cursor = cnx.cursor()                   # cursor object 

cursor.execute("""SHOW tables""")       # generate list of existing tables in database Employees

row = cursor.fetchone()

while row is not None:
    print(row)
    row = cursor.fetchone()
    
cursor.close()                          # close.cursor()
cnx.close()

('customers',)
('employees',)
('offices',)
('orderdetails',)
('orders',)
('payments',)
('productlines',)
('products',)

In [4]:
cnx = mysql.connector.connect(**config)                # connect 
cursor = cnx.cursor()                   
    
cursor.execute("""SELECT COUNT(*) FROM employees; """)       # Filter only the employees whose title is "Manager"
num_emp = cursor.fetchall()
    
cursor.close()                           
cnx.close()                                            # disconnect

print('There are a total of {} employees'.format(num_emp[0][0]))

There are a total of 23 employees

In [5]:
cnx = mysql.connector.connect(**config)                # connect 
cursor = cnx.cursor()                   

cursor.execute("""SELECT firstName,
       lastName,
       Count(employeeNumber) AS numberOfCustomers
       FROM employees AS e
       LEFT JOIN customers AS c
       ON e.employeeNumber = c.salesRepEmployeeNumber
       GROUP BY employeeNumber
       ORDER BY numberOfCustomers DESC
       LIMIT 10;""")
results = cursor.fetchall()

cursor.close()                           
cnx.close()

pd.DataFrame(results, columns = ['First Name', 'Last Name', 'Number of Customers'])

  First Name  Last Name  Number of Customers
0     Pamela   Castillo                   10
1      Barry      Jones                    9
2     George     Vanauf                    8
3      Larry       Bott                    8
4     Gerard  Hernandez                    7
5   Foon Yue      Tseng                    7
6     Leslie   Jennings                    6
7     Leslie   Thompson                    6
8      Julie   Firrelli                    6
9      Steve  Patterson                    6

In [6]:
cnx = mysql.connector.connect(**config)                # connect 
cursor = cnx.cursor()

cursor.execute("""SELECT * FROM employees
                    WHERE employeeNumber IN (
                        SELECT DISTINCT reportsTo FROM employees 
                        WHERE reportsTo IS NOT NULL);""")
results = cursor.fetchall()  

cursor.close()                           
cnx.close()

pd.DataFrame(results, columns = ['Employee Number', 'Last Name', 'First Name',
                                'Extension', 'Email', 'Office', 'Reports to', 'Position'])

,Employee Number,Last Name,First Name,Extension,Email,Office,Reports to,Position
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
3,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
4,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056.0,Sales Manager (NA)
5,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056.0,Sales Rep

In [7]:
cnx = mysql.connector.connect(**config)                # connect 
cursor = cnx.cursor()

cursor.execute("""SELECT RANK() OVER(ORDER BY Count(employeeNumber) DESC) AS ranking,
       firstName,
       lastName,
       Count(employeeNumber) AS numberOfCustomers
       FROM employees AS e
       LEFT JOIN customers AS c
       ON e.employeeNumber = c.salesRepEmployeeNumber
       GROUP BY employeeNumber
       LIMIT 10;
       """)
results = cursor.fetchall()

cursor.close()                           
cnx.close()

pd.DataFrame(results, columns = ['Rank','First Name', 'Last Name', 'Number of Customers'])

   Rank First Name  Last Name  Number of Customers
0     1     Pamela   Castillo                   10
1     2      Barry      Jones                    9
2     3     George     Vanauf                    8
3     3      Larry       Bott                    8
4     5   Foon Yue      Tseng                    7
5     5     Gerard  Hernandez                    7
6     7     Leslie   Jennings                    6
7     7     Leslie   Thompson                    6
8     7      Julie   Firrelli                    6
9     7      Steve  Patterson                    6

In [8]:
cnx = mysql.connector.connect(**config)                # connect 
cursor = cnx.cursor()

cursor.execute("""SELECT RANK() OVER(ORDER BY Count(employeeNumber) DESC) AS Ranking,
       firstName AS `First Name`,
       lastName AS `Last Name`,
       SUM(od.quantityOrdered * od.priceEach) AS Revenue
       FROM employees AS e
       LEFT JOIN customers AS c
       ON e.employeeNumber = c.salesRepEmployeeNumber
       LEFT JOIN orders as o
       ON o.customerNumber = c.customerNumber
       LEFT JOIN orderdetails as od
       ON o.orderNumber = od.orderNumber
       GROUP BY employeeNumber
       LIMIT 10;
       """)
results = cursor.fetchall()

cursor.close()                           
cnx.close()

pd.DataFrame(results, columns = ['Rank','First Name', 'Last Name', 'Revenue'])

   Rank First Name  Last Name     Revenue
0     1     Gerard  Hernandez  1258577.81
1     2     Leslie   Jennings  1081530.54
2     3     Pamela   Castillo   868220.55
3     4      Larry       Bott   732096.79
4     5      Barry      Jones   704853.91
5     6     George     Vanauf   669377.05
6     7       Andy     Fixter   562582.59
7     7      Peter      Marsh   584593.76
8     9       Loui     Bondur   569485.75
9    10      Steve  Patterson   505875.42

In [ ]:
cnx = mysql.connector.connect(**config)                # connect 
cursor = cnx.cursor()

cursor.execute("""SELECT RANK() OVER(ORDER BY Count(employeeNumber) DESC) AS Ranking,
       firstName AS `First Name`,
       lastName AS `Last Name`,
       SUM(od.quantityOrdered * od.priceEach) AS Revenue
       FROM employees AS e
       LEFT JOIN customers AS c
       ON e.employeeNumber = c.salesRepEmployeeNumber
       LEFT JOIN orders as o
       ON o.customerNumber = c.customerNumber
       LEFT JOIN orderdetails as od
       ON o.orderNumber = od.orderNumber
       GROUP BY employeeNumber
       LIMIT 10;
       """)
results = cursor.fetchall()

cursor.close()                           
cnx.close()

pd.DataFrame(results, columns = ['Rank','First Name', 'Last Name', 'Revenue'])